// Користувач може оформити доставку товару до себе в країну,
// вказавши її при відвідуванні сторінки в prompt.
// Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра,
// а наприклад 'кИтАЙ'.

// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну.
//  Обов'язково використовуй switch. Формат повідомлення:
//  'Доставка в [країна] буде коштувати [ціна] кредитів'.

// Але доставка є не скрізь, якщо зазначеної країни немає в списку,
// то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

// Нижче наведено список країн і вартість доставки.

// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів

let nameYourCountry = prompt("Введіть країну доставки");
let message = 0;
let price = 0;

switch (nameYourCountry.toUpperCase()) {
  case "КИТАЙ":
    price = 100;
    message = `Доставка в ${nameYourCountry} буде коштувати ${price} кредитів`;
    break;

  case "ЧИЛІ":
    price = 250;
    message = `Доставка в ${nameYourCountry} буде коштувати ${price} кредитів`;
    break;

  case "АВСТРАЛІЯ":
    price = 170;
    message = `Доставка в ${nameYourCountry} буде коштувати ${price} кредитів`;
    break;

  case "ІНДІЯ":
    price = 80;
    message = `Доставка в ${nameYourCountry} буде коштувати ${price} кредитів`;
    break;

  case "ЯМАЙКА":
    price = 120;
    message = `Доставка в ${nameYourCountry} буде коштувати ${price} кредитів`;
    break;

  default:
    console.log("У вашій країні доставка недоступна");
}
console.log(message);
